dashoffice_cjr/app/views/devise/registrations/new.html.erb

SELECT "cores".* FROM "cores"
SELECT "roles".* FROM "roles"
---

      <%= f.input :core_id,
                  collection: Core.all,
                  required: true %>

      <%= f.input :role_id,
                  collection: Role.all,
                  required: true %>